Конфигурация/InformationRegisters/СвязанныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>СвязанныеЛица</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОснования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВключенияВСписок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСвязи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыСвязейЮрФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязанноеЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СвязанныеЛица/Forms/ФормаСпискаСвязанныхЛиц/Ext/Form/Module.bsl
#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтаФорма.Организация = Параметры.Организация;
	ЭтаФорма.ЮрФизЛицо = Параметры.ЮрФизЛицо;
	
	ЮрФизЛицоОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтаФорма.Организация, "ЮрФизЛицо");
	Элементы.СвязанныеЛицаТипСвязи.Видимость = (ЮрФизЛицоОрганизации = ЭтаФорма.ЮрФизЛицо);
	
	ЗаполнитьТаблицыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	РаботаСФормамиКлиент.ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка, Модифицированность);
КонецПроцедуры
 
#КонецОбласти 

#Область Обработчики_событий_элементов_формы



#КонецОбласти 

#Область Команды_формы

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	
	КомандаЗаписатьНаСервере();
	ЭтаФорма.Модифицированность = Ложь;
	
КонецПроцедуры

#КонецОбласти 

#Область Служебные_процедуры_и_функции

&НаСервере
Процедура ЗаполнитьТаблицыНаСервере()

	#Область Текст_запроса
	ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СвязанныеЛицаНачалоПериода.ТипСвязи КАК ТипСвязи,
		|	СвязанныеЛицаНачалоПериода.СвязанноеЮрФизЛицо КАК СвязанноеЛицо,
		|	СвязанныеЛицаНачалоПериода.Период КАК НачалоПериода,
		|	МИНИМУМ(СвязанныеЛицаОкончаниеПериода.Период) КАК ОкончаниеПериода
		|ИЗ
		|	РегистрСведений.СвязанныеЛица КАК СвязанныеЛицаНачалоПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СвязанныеЛица КАК СвязанныеЛицаОкончаниеПериода
		|		ПО СвязанныеЛицаНачалоПериода.Организация = СвязанныеЛицаОкончаниеПериода.Организация
		|			И СвязанныеЛицаНачалоПериода.ЮрФизЛицо = СвязанныеЛицаОкончаниеПериода.ЮрФизЛицо
		|			И СвязанныеЛицаНачалоПериода.ТипСвязи = СвязанныеЛицаОкончаниеПериода.ТипСвязи
		|			И СвязанныеЛицаНачалоПериода.СвязанноеЮрФизЛицо = СвязанныеЛицаОкончаниеПериода.СвязанноеЮрФизЛицо
		|			И (НЕ СвязанныеЛицаОкончаниеПериода.Действует)
		|			И СвязанныеЛицаНачалоПериода.Период < СвязанныеЛицаОкончаниеПериода.Период
		|ГДЕ
		|	СвязанныеЛицаНачалоПериода.Действует
		|	И СвязанныеЛицаНачалоПериода.Организация = &Организация
		|	И СвязанныеЛицаНачалоПериода.ЮрФизЛицо = &ЮрФизЛицо
		|
		|СГРУППИРОВАТЬ ПО
		|	СвязанныеЛицаНачалоПериода.ТипСвязи,
		|	СвязанныеЛицаНачалоПериода.СвязанноеЮрФизЛицо,
		|	СвязанныеЛицаНачалоПериода.Период
		|
		|УПОРЯДОЧИТЬ ПО
		|	НачалоПериода,
		|	СвязанноеЛицо
		|АВТОУПОРЯДОЧИВАНИЕ";		
	#КонецОбласти 
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Организация", ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицо", ЭтаФорма.ЮрФизЛицо);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
	
		Если Выборка.ТипСвязи = Справочники.ТипыСвязейЮрФизЛиц.УправляющаяКомпания Тогда
			НоваяСтрока = ЭтаФорма.УправляющиеКомпании.Добавить();
		ИначеЕсли Выборка.ТипСвязи = Справочники.ТипыСвязейЮрФизЛиц.Спецдепозитарий Тогда
			НоваяСтрока = ЭтаФорма.Спецдепозитарии.Добавить();
		ИначеЕсли Выборка.ТипСвязи = Справочники.ТипыСвязейЮрФизЛиц.Аудитор Тогда
			НоваяСтрока = ЭтаФорма.Аудиторы.Добавить();
		ИначеЕсли Выборка.ТипСвязи = Справочники.ТипыСвязейЮрФизЛиц.Оценщик Тогда
			НоваяСтрока = ЭтаФорма.Оценщики.Добавить();
		ИначеЕсли Выборка.ТипСвязи = Справочники.ТипыСвязейЮрФизЛиц.Актуарий Тогда
			НоваяСтрока = ЭтаФорма.Актуарии.Добавить();
		Иначе
			НоваяСтрока = ЭтаФорма.СвязанныеЛица.Добавить();
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура КомандаЗаписатьНаСервере()

	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("УправляющиеКомпании", Справочники.ТипыСвязейЮрФизЛиц.УправляющаяКомпания);
	СтруктураТаблиц.Вставить("Спецдепозитарии", 	Справочники.ТипыСвязейЮрФизЛиц.Спецдепозитарий);
	СтруктураТаблиц.Вставить("Аудиторы", 			Справочники.ТипыСвязейЮрФизЛиц.Аудитор);
	СтруктураТаблиц.Вставить("Оценщики", 			Справочники.ТипыСвязейЮрФизЛиц.Оценщик);
	СтруктураТаблиц.Вставить("Актуарии", 			Справочники.ТипыСвязейЮрФизЛиц.Актуарий);
	
	СводнаяТаблица = Неопределено;
	Для каждого ТипСвязи Из СтруктураТаблиц Цикл
	
		ТЗ = ЭтаФорма[ТипСвязи.Ключ].Выгрузить();
		ТЗ.Колонки.Добавить("ТипСвязи", Новый ОписаниеТипов("СправочникСсылка.ТипыСвязейЮрФизЛиц"));
		ТЗ.ЗаполнитьЗначения(ТипСвязи.Значение, "ТипСвязи");
		
		Если СводнаяТаблица = Неопределено Тогда
			СводнаяТаблица = ТЗ;
		Иначе
			РаботаСКоллекциями.ТаблицаЗначений_Дополнить(ТЗ, СводнаяТаблица);
		КонецЕсли; 
	
	КонецЦикла; 
	
	ТекстЗапроса = 
	#Область Текст_запроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СводнаяТаблица.СвязанноеЛицо КАК СвязанноеЛицо,
		|	СводнаяТаблица.ТипСвязи КАК ТипСвязи,
		|	СводнаяТаблица.НачалоПериода КАК НачалоПериода,
		|	СводнаяТаблица.ОкончаниеПериода КАК ОкончаниеПериода
		|ПОМЕСТИТЬ _СводнаяТаблица
		|ИЗ
		|	&СводнаяТаблица КАК СводнаяТаблица
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_СводнаяТаблица.НачалоПериода КАК Период,
		|	_СводнаяТаблица.ТипСвязи КАК ТипСвязи,
		|	_СводнаяТаблица.СвязанноеЛицо КАК СвязанноеЛицо,
		|	ИСТИНА КАК Действует
		|ПОМЕСТИТЬ _СвязанныеЛицаНовые
		|ИЗ
		|	_СводнаяТаблица КАК _СводнаяТаблица
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_СводнаяТаблица.ОкончаниеПериода,
		|	_СводнаяТаблица.ТипСвязи,
		|	_СводнаяТаблица.СвязанноеЛицо,
		|	ЛОЖЬ
		|ИЗ
		|	_СводнаяТаблица КАК _СводнаяТаблица
		|ГДЕ
		|	_СводнаяТаблица.ОкончаниеПериода <> ДАТАВРЕМЯ(1, 1, 1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СвязанныеЛица.Период КАК Период,
		|	СвязанныеЛица.Организация КАК Организация,
		|	СвязанныеЛица.ЮрФизЛицо КАК ЮрФизЛицо,
		|	СвязанныеЛица.ТипСвязи КАК ТипСвязи,
		|	СвязанныеЛица.СвязанноеЮрФизЛицо КАК СвязанноеЮрФизЛицо,
		|	СвязанныеЛица.Действует КАК Действует
		|ПОМЕСТИТЬ _СвязанныеЛицаТекущие
		|ИЗ
		|	РегистрСведений.СвязанныеЛица КАК СвязанныеЛица
		|ГДЕ
		|	СвязанныеЛица.Организация = &Организация
		|	И СвязанныеЛица.ЮрФизЛицо = &ЮрФизЛицо
		|	И СвязанныеЛица.ТипСвязи В ИЕРАРХИИ (ЗНАЧЕНИЕ(Справочник.ТипыСвязейЮрФизЛиц.ИсполнителиРолей))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕСТЬNULL(_СвязанныеЛицаТекущие.Период, _СвязанныеЛицаНовые.Период) КАК Период,
		|	ЕСТЬNULL(_СвязанныеЛицаТекущие.Организация, &Организация) КАК Организация,
		|	ЕСТЬNULL(_СвязанныеЛицаТекущие.ЮрФизЛицо, &ЮрФизЛицо) КАК ЮрФизЛицо,
		|	ЕСТЬNULL(_СвязанныеЛицаТекущие.ТипСвязи, _СвязанныеЛицаНовые.ТипСвязи) КАК ТипСвязи,
		|	ЕСТЬNULL(_СвязанныеЛицаТекущие.СвязанноеЮрФизЛицо, _СвязанныеЛицаНовые.СвязанноеЛицо) КАК СвязанноеЮрФизЛицо,
		|	ЕСТЬNULL(_СвязанныеЛицаТекущие.Действует, _СвязанныеЛицаНовые.Действует) КАК Действует,
		|	_СвязанныеЛицаНовые.СвязанноеЛицо ЕСТЬ NULL КАК Удалить
		|ИЗ
		|	_СвязанныеЛицаТекущие КАК _СвязанныеЛицаТекущие
		|		ПОЛНОЕ СОЕДИНЕНИЕ _СвязанныеЛицаНовые КАК _СвязанныеЛицаНовые
		|		ПО _СвязанныеЛицаТекущие.Период = _СвязанныеЛицаНовые.Период
		|			И _СвязанныеЛицаТекущие.ТипСвязи = _СвязанныеЛицаНовые.ТипСвязи
		|			И _СвязанныеЛицаТекущие.СвязанноеЮрФизЛицо = _СвязанныеЛицаНовые.СвязанноеЛицо
		|			И _СвязанныеЛицаТекущие.Действует = _СвязанныеЛицаНовые.Действует
		|ГДЕ
		|	(_СвязанныеЛицаТекущие.СвязанноеЮрФизЛицо ЕСТЬ NULL
		|			ИЛИ _СвязанныеЛицаНовые.СвязанноеЛицо ЕСТЬ NULL)";	
	#КонецОбласти 
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СводнаяТаблица", СводнаяТаблица);
	Запрос.УстановитьПараметр("Организация", 	ЭтаФорма.Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицо", 		ЭтаФорма.ЮрФизЛицо);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Отказ = Ложь;
	
	НачатьТранзакцию();
	
	Пока Выборка.Следующий() Цикл
		
		ОшибкиЗаполнения = Новый Массив;
		
		Если Не ЗначениеЗаполнено(Выборка.Период) Тогда
			ОшибкиЗаполнения.Добавить("дату начала периода действия связи");
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Выборка.СвязанноеЮрФизЛицо) Тогда
			ОшибкиЗаполнения.Добавить("юр./физ. лицо");
		КонецЕсли;
		
		Если ОшибкиЗаполнения.Количество() > 0 Тогда
			
			ОшибкиСтрока = СтрСоединить(ОшибкиЗаполнения, " и ");
			
			Если ЗначениеЗаполнено(Выборка.СвязанноеЮрФизЛицо) Тогда
				// если заполнен - добавим наименование к сообщению
				ОшибкиСтрока = ОшибкиСтрока + " " + Выборка.СвязанноеЮрФизЛицо;
			КонецЕсли; 
			
			ТекстОшибки = СтрШаблон("Необходимо заполнить %1 для роли %2", ОшибкиСтрока, Выборка.ТипСвязи);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,, Отказ); 
			
			Продолжить;
			
		КонецЕсли; 
		
		Запись = РегистрыСведений.СвязанныеЛица.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Если Выборка.Удалить Тогда
			Запись.Удалить();
		Иначе
			Запись.Записать();
		КонецЕсли; 
	
	КонецЦикла;
	
	Если Отказ Тогда
	    ОтменитьТранзакцию();
	Иначе
		ЗафиксироватьТранзакцию();	
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
